# Length Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRail..::..Length Property
ContinuousRail Class See Also
---
The length of the rail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Length { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Length As Double
	Get
```

Visual C++
---
```text
public:
property double Length {
	double get ();
}
```

# See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace